mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2gkxj/common/s6e2gkxj.h
        stc_ethernet_mac_stnur_field_t STNUR_f;
        struct {
          union {
            __IO uint16_t STNURL;
            struct {
              __IO uint8_t STNURLL;
              __IO uint8_t STNURLH;
            };
          };
          union {
            __IO uint16_t STNURH;
            struct {
              __IO uint8_t STNURHL;
              __IO uint8_t STNURHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TSAR;
        stc_ethernet_mac_tsar_field_t TSAR_f;
        struct {
          union {
            __IO uint16_t TSARL;
            struct {
              __IO uint8_t TSARLL;
              __IO uint8_t TSARLH;
            };
          };
          union {
            __IO uint16_t TSARH;
            struct {
              __IO uint8_t TSARHL;
              __IO uint8_t TSARHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TTSR;
        stc_ethernet_mac_ttsr_field_t TTSR_f;
        struct {
          union {
            __IO uint16_t TTSRL;
            struct {
              __IO uint8_t TTSRLL;
              __IO uint8_t TTSRLH;
            };
          };
          union {
            __IO uint16_t TTSRH;
            struct {
              __IO uint8_t TTSRHL;
              __IO uint8_t TTSRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TTNR;
        stc_ethernet_mac_ttnr_field_t TTNR_f;
        struct {
          union {
            __IO uint16_t TTNRL;
            struct {
              __IO uint8_t TTNRLL;
              __IO uint8_t TTNRLH;
            };
          };
          union {
            __IO uint16_t TTNRH;
            struct {
              __IO uint8_t TTNRHL;
              __IO uint8_t TTNRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t STHWSR;
        stc_ethernet_mac_sthwsr_field_t STHWSR_f;
        struct {
          union {
            __IO uint16_t STHWSRL;
            struct {
              __IO uint8_t STHWSRLL;
              __IO uint8_t STHWSRLH;
            };
          };
          union {
            __IO uint16_t STHWSRH;
            struct {
              __IO uint8_t STHWSRHL;
              __IO uint8_t STHWSRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TSR;
        stc_ethernet_mac_tsr_field_t TSR_f;
        struct {
          union {
            __IO uint16_t TSRL;
            struct {
              __IO uint8_t TSRLL;
              __IO uint8_t TSRLH;
            };
          };
          union {
            __IO uint16_t TSRH;
            struct {
              __IO uint8_t TSRHL;
              __IO uint8_t TSRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PPSCR;
        stc_ethernet_mac_ppscr_field_t PPSCR_f;
        struct {
          union {
            __IO uint16_t PPSCRL;
            struct {
              __IO uint8_t PPSCRLL;
              __IO uint8_t PPSCRLH;
            };
          };
          union {
            __IO uint16_t PPSCRH;
            struct {
              __IO uint8_t PPSCRHL;
              __IO uint8_t PPSCRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t ATNR;
        stc_ethernet_mac_atnr_field_t ATNR_f;
        struct {
          union {
            __IO uint16_t ATNRL;
            struct {
              __IO uint8_t ATNRLL;
              __IO uint8_t ATNRLH;
            };
          };
          union {
            __IO uint16_t ATNRH;
            struct {
              __IO uint8_t ATNRHL;
              __IO uint8_t ATNRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t ATSR;
        stc_ethernet_mac_atsr_field_t ATSR_f;
        struct {
          union {
            __IO uint16_t ATSRL;
            struct {
              __IO uint8_t ATSRLL;
              __IO uint8_t ATSRLH;
            };
          };
          union {
            __IO uint16_t ATSRH;
            struct {
              __IO uint8_t ATSRHL;
              __IO uint8_t ATSRHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED9[200];
    union {
        __IO uint32_t MAR16H;
        stc_ethernet_mac_mar16h_field_t MAR16H_f;
        struct {
          union {
            __IO uint16_t MAR16HL;
            struct {
              __IO uint8_t MAR16HLL;
              __IO uint8_t MAR16HLH;
            };
          };
          union {
            __IO uint16_t MAR16HH;
            struct {
              __IO uint8_t MAR16HHL;
              __IO uint8_t MAR16HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR16L;
        stc_ethernet_mac_mar16l_field_t MAR16L_f;
        struct {
          union {
            __IO uint16_t MAR16LL;
            struct {
              __IO uint8_t MAR16LLL;
              __IO uint8_t MAR16LLH;
            };
          };
          union {
            __IO uint16_t MAR16LH;
            struct {
              __IO uint8_t MAR16LHL;
              __IO uint8_t MAR16LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR17H;
        stc_ethernet_mac_mar17h_field_t MAR17H_f;
        struct {
          union {
            __IO uint16_t MAR17HL;
            struct {
              __IO uint8_t MAR17HLL;
              __IO uint8_t MAR17HLH;
            };
          };
          union {
            __IO uint16_t MAR17HH;
            struct {
              __IO uint8_t MAR17HHL;
              __IO uint8_t MAR17HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR17L;
        stc_ethernet_mac_mar17l_field_t MAR17L_f;
        struct {
          union {
            __IO uint16_t MAR17LL;
            struct {
              __IO uint8_t MAR17LLL;
              __IO uint8_t MAR17LLH;
            };
          };
          union {
            __IO uint16_t MAR17LH;
            struct {
              __IO uint8_t MAR17LHL;
              __IO uint8_t MAR17LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR18H;
        stc_ethernet_mac_mar18h_field_t MAR18H_f;
        struct {
          union {
            __IO uint16_t MAR18HL;
            struct {
              __IO uint8_t MAR18HLL;
              __IO uint8_t MAR18HLH;
            };
          };
          union {
            __IO uint16_t MAR18HH;
            struct {
              __IO uint8_t MAR18HHL;
              __IO uint8_t MAR18HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR18L;
        stc_ethernet_mac_mar18l_field_t MAR18L_f;
        struct {
          union {
            __IO uint16_t MAR18LL;
            struct {
              __IO uint8_t MAR18LLL;
              __IO uint8_t MAR18LLH;
            };
          };
          union {
            __IO uint16_t MAR18LH;
            struct {
              __IO uint8_t MAR18LHL;
              __IO uint8_t MAR18LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR19H;
        stc_ethernet_mac_mar19h_field_t MAR19H_f;
        struct {
          union {
            __IO uint16_t MAR19HL;
            struct {
              __IO uint8_t MAR19HLL;
              __IO uint8_t MAR19HLH;
            };
          };
          union {
            __IO uint16_t MAR19HH;
            struct {
              __IO uint8_t MAR19HHL;
              __IO uint8_t MAR19HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR19L;
        stc_ethernet_mac_mar19l_field_t MAR19L_f;
        struct {
          union {
            __IO uint16_t MAR19LL;
            struct {
              __IO uint8_t MAR19LLL;
              __IO uint8_t MAR19LLH;
            };
          };
          union {
            __IO uint16_t MAR19LH;
            struct {
              __IO uint8_t MAR19LHL;
              __IO uint8_t MAR19LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR20H;
        stc_ethernet_mac_mar20h_field_t MAR20H_f;
        struct {
          union {
            __IO uint16_t MAR20HL;
            struct {
              __IO uint8_t MAR20HLL;
              __IO uint8_t MAR20HLH;
            };
          };
          union {
            __IO uint16_t MAR20HH;
            struct {
              __IO uint8_t MAR20HHL;
              __IO uint8_t MAR20HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR20L;
        stc_ethernet_mac_mar20l_field_t MAR20L_f;
        struct {
          union {
            __IO uint16_t MAR20LL;
            struct {
              __IO uint8_t MAR20LLL;
              __IO uint8_t MAR20LLH;
            };
          };
          union {
            __IO uint16_t MAR20LH;
            struct {
              __IO uint8_t MAR20LHL;
              __IO uint8_t MAR20LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR21H;
        stc_ethernet_mac_mar21h_field_t MAR21H_f;
        struct {
          union {
            __IO uint16_t MAR21HL;
            struct {
              __IO uint8_t MAR21HLL;
              __IO uint8_t MAR21HLH;
            };
          };
          union {
            __IO uint16_t MAR21HH;
            struct {
              __IO uint8_t MAR21HHL;
              __IO uint8_t MAR21HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR21L;
        stc_ethernet_mac_mar21l_field_t MAR21L_f;
        struct {
          union {
            __IO uint16_t MAR21LL;
            struct {
              __IO uint8_t MAR21LLL;
              __IO uint8_t MAR21LLH;
            };
          };
          union {
            __IO uint16_t MAR21LH;
            struct {
              __IO uint8_t MAR21LHL;
              __IO uint8_t MAR21LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR22H;
        stc_ethernet_mac_mar22h_field_t MAR22H_f;
        struct {
          union {
            __IO uint16_t MAR22HL;
            struct {
              __IO uint8_t MAR22HLL;
              __IO uint8_t MAR22HLH;
            };
          };
          union {
            __IO uint16_t MAR22HH;
            struct {
              __IO uint8_t MAR22HHL;
              __IO uint8_t MAR22HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR22L;
        stc_ethernet_mac_mar22l_field_t MAR22L_f;
        struct {
          union {
            __IO uint16_t MAR22LL;
            struct {
              __IO uint8_t MAR22LLL;
              __IO uint8_t MAR22LLH;
            };
          };
          union {
            __IO uint16_t MAR22LH;
            struct {
              __IO uint8_t MAR22LHL;
              __IO uint8_t MAR22LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR23H;
        stc_ethernet_mac_mar23h_field_t MAR23H_f;
        struct {
          union {
            __IO uint16_t MAR23HL;
            struct {
              __IO uint8_t MAR23HLL;
              __IO uint8_t MAR23HLH;
            };
          };
          union {
            __IO uint16_t MAR23HH;
            struct {
              __IO uint8_t MAR23HHL;
              __IO uint8_t MAR23HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR23L;
        stc_ethernet_mac_mar23l_field_t MAR23L_f;
        struct {
          union {
            __IO uint16_t MAR23LL;
            struct {
              __IO uint8_t MAR23LLL;
              __IO uint8_t MAR23LLH;
            };
          };
          union {
            __IO uint16_t MAR23LH;
            struct {
              __IO uint8_t MAR23LHL;
              __IO uint8_t MAR23LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR24H;
        stc_ethernet_mac_mar24h_field_t MAR24H_f;
        struct {
          union {
            __IO uint16_t MAR24HL;
            struct {
              __IO uint8_t MAR24HLL;
              __IO uint8_t MAR24HLH;
            };
          };
          union {
            __IO uint16_t MAR24HH;
            struct {
              __IO uint8_t MAR24HHL;
              __IO uint8_t MAR24HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR24L;
        stc_ethernet_mac_mar24l_field_t MAR24L_f;
        struct {
          union {
            __IO uint16_t MAR24LL;
            struct {
              __IO uint8_t MAR24LLL;
              __IO uint8_t MAR24LLH;
            };
          };
          union {
            __IO uint16_t MAR24LH;
            struct {
              __IO uint8_t MAR24LHL;
              __IO uint8_t MAR24LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR25H;
        stc_ethernet_mac_mar25h_field_t MAR25H_f;
        struct {
          union {
            __IO uint16_t MAR25HL;
            struct {
              __IO uint8_t MAR25HLL;
              __IO uint8_t MAR25HLH;
            };
          };
          union {
            __IO uint16_t MAR25HH;
            struct {
              __IO uint8_t MAR25HHL;
              __IO uint8_t MAR25HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR25L;
        stc_ethernet_mac_mar25l_field_t MAR25L_f;
        struct {
          union {
            __IO uint16_t MAR25LL;
            struct {
              __IO uint8_t MAR25LLL;
              __IO uint8_t MAR25LLH;
            };
          };
          union {
            __IO uint16_t MAR25LH;
            struct {
              __IO uint8_t MAR25LHL;
              __IO uint8_t MAR25LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR26H;
        stc_ethernet_mac_mar26h_field_t MAR26H_f;
        struct {
          union {
            __IO uint16_t MAR26HL;
            struct {
              __IO uint8_t MAR26HLL;
              __IO uint8_t MAR26HLH;
            };
          };
          union {
            __IO uint16_t MAR26HH;
            struct {
              __IO uint8_t MAR26HHL;
              __IO uint8_t MAR26HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR26L;
        stc_ethernet_mac_mar26l_field_t MAR26L_f;
        struct {
          union {
            __IO uint16_t MAR26LL;
            struct {
              __IO uint8_t MAR26LLL;
              __IO uint8_t MAR26LLH;
            };
          };
          union {
            __IO uint16_t MAR26LH;
            struct {
              __IO uint8_t MAR26LHL;
              __IO uint8_t MAR26LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR27H;
        stc_ethernet_mac_mar27h_field_t MAR27H_f;
        struct {
          union {
            __IO uint16_t MAR27HL;
            struct {
              __IO uint8_t MAR27HLL;
              __IO uint8_t MAR27HLH;
            };
          };
          union {
            __IO uint16_t MAR27HH;
            struct {
              __IO uint8_t MAR27HHL;
              __IO uint8_t MAR27HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR27L;
        stc_ethernet_mac_mar27l_field_t MAR27L_f;
        struct {
          union {
            __IO uint16_t MAR27LL;
            struct {
              __IO uint8_t MAR27LLL;
              __IO uint8_t MAR27LLH;
            };
          };
          union {
            __IO uint16_t MAR27LH;
            struct {
              __IO uint8_t MAR27LHL;
              __IO uint8_t MAR27LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR28H;
        stc_ethernet_mac_mar28h_field_t MAR28H_f;
        struct {
          union {
            __IO uint16_t MAR28HL;
            struct {
              __IO uint8_t MAR28HLL;
              __IO uint8_t MAR28HLH;
            };
          };
          union {
            __IO uint16_t MAR28HH;
            struct {
              __IO uint8_t MAR28HHL;
              __IO uint8_t MAR28HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR28L;
        stc_ethernet_mac_mar28l_field_t MAR28L_f;
        struct {
          union {
            __IO uint16_t MAR28LL;
            struct {
              __IO uint8_t MAR28LLL;
              __IO uint8_t MAR28LLH;
            };
          };
          union {
            __IO uint16_t MAR28LH;
            struct {
              __IO uint8_t MAR28LHL;
              __IO uint8_t MAR28LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR29H;
        stc_ethernet_mac_mar29h_field_t MAR29H_f;
        struct {
          union {
            __IO uint16_t MAR29HL;
            struct {
              __IO uint8_t MAR29HLL;
              __IO uint8_t MAR29HLH;
            };
          };
          union {
            __IO uint16_t MAR29HH;
            struct {
              __IO uint8_t MAR29HHL;
              __IO uint8_t MAR29HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR29L;
        stc_ethernet_mac_mar29l_field_t MAR29L_f;
        struct {
          union {
            __IO uint16_t MAR29LL;
            struct {
              __IO uint8_t MAR29LLL;
              __IO uint8_t MAR29LLH;
            };
          };
          union {
            __IO uint16_t MAR29LH;
            struct {
              __IO uint8_t MAR29LHL;
              __IO uint8_t MAR29LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR30H;
        stc_ethernet_mac_mar30h_field_t MAR30H_f;
        struct {
          union {
            __IO uint16_t MAR30HL;
            struct {
              __IO uint8_t MAR30HLL;
              __IO uint8_t MAR30HLH;
            };
          };
          union {
            __IO uint16_t MAR30HH;
            struct {
              __IO uint8_t MAR30HHL;
              __IO uint8_t MAR30HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR30L;
        stc_ethernet_mac_mar30l_field_t MAR30L_f;
        struct {
          union {
            __IO uint16_t MAR30LL;
            struct {
              __IO uint8_t MAR30LLL;
              __IO uint8_t MAR30LLH;
            };
          };
          union {
            __IO uint16_t MAR30LH;
            struct {
              __IO uint8_t MAR30LHL;
              __IO uint8_t MAR30LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR31H;
        stc_ethernet_mac_mar31h_field_t MAR31H_f;
        struct {
          union {
            __IO uint16_t MAR31HL;
            struct {
              __IO uint8_t MAR31HLL;
              __IO uint8_t MAR31HLH;
            };
          };
          union {
            __IO uint16_t MAR31HH;
            struct {
              __IO uint8_t MAR31HHL;
              __IO uint8_t MAR31HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR31L;
        stc_ethernet_mac_mar31l_field_t MAR31L_f;
        struct {
          union {
            __IO uint16_t MAR31LL;
            struct {
              __IO uint8_t MAR31LLL;
              __IO uint8_t MAR31LLH;
            };
          };
          union {
            __IO uint16_t MAR31LH;
            struct {
              __IO uint8_t MAR31LHL;
              __IO uint8_t MAR31LHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED10[1920];
    union {
        __IO uint32_t BMR;
        stc_ethernet_mac_bmr_field_t BMR_f;
        struct {
          union {
            __IO uint16_t BMRL;
            struct {
              __IO uint8_t BMRLL;
              __IO uint8_t BMRLH;
            };
          };
          union {
            __IO uint16_t BMRH;
            struct {
              __IO uint8_t BMRHL;
              __IO uint8_t BMRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TPDR;
        stc_ethernet_mac_tpdr_field_t TPDR_f;
        struct {
          union {
            __IO uint16_t TPDRL;
            struct {
              __IO uint8_t TPDRLL;
              __IO uint8_t TPDRLH;
            };
          };
          union {
            __IO uint16_t TPDRH;
            struct {
              __IO uint8_t TPDRHL;
              __IO uint8_t TPDRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RPDR;
        stc_ethernet_mac_rpdr_field_t RPDR_f;
        struct {
          union {
            __IO uint16_t RPDRL;
            struct {
              __IO uint8_t RPDRLL;
              __IO uint8_t RPDRLH;
            };
          };
          union {
            __IO uint16_t RPDRH;
            struct {
              __IO uint8_t RPDRHL;
              __IO uint8_t RPDRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RDLAR;
        stc_ethernet_mac_rdlar_field_t RDLAR_f;
        struct {
          union {
            __IO uint16_t RDLARL;
            struct {
              __IO uint8_t RDLARLL;
              __IO uint8_t RDLARLH;
            };
          };
          union {
            __IO uint16_t RDLARH;
            struct {
              __IO uint8_t RDLARHL;
              __IO uint8_t RDLARHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TDLAR;
        stc_ethernet_mac_tdlar_field_t TDLAR_f;
        struct {
          union {
            __IO uint16_t TDLARL;
            struct {
              __IO uint8_t TDLARLL;
              __IO uint8_t TDLARLH;
            };
          };
          union {
            __IO uint16_t TDLARH;
            struct {
              __IO uint8_t TDLARHL;
              __IO uint8_t TDLARHH;
            };
          };
        };
    };
    union {
        __IO uint32_t SR;
        stc_ethernet_mac_sr_field_t SR_f;
        struct {
          union {
            __IO uint16_t SRL;
            struct {
              __IO uint8_t SRLL;
              __IO uint8_t SRLH;
            };
          };
          union {
            __IO uint16_t SRH;
            struct {
              __IO uint8_t SRHL;
              __IO uint8_t SRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t OMR;
        stc_ethernet_mac_omr_field_t OMR_f;
        struct {
          union {
            __IO uint16_t OMRL;
            struct {
              __IO uint8_t OMRLL;
              __IO uint8_t OMRLH;
            };
          };
          union {
            __IO uint16_t OMRH;
            struct {
              __IO uint8_t OMRHL;
              __IO uint8_t OMRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IER;
        stc_ethernet_mac_ier_field_t IER_f;
        struct {
          union {
            __IO uint16_t IERL;
            struct {
              __IO uint8_t IERLL;
              __IO uint8_t IERLH;
            };
          };
