mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2gkxj/common/s6e2gkxj.h
#define FM_MFS1_CSIO_BASE                         (0x40038100UL) /* MFS1 Base Address */
#define FM4_MFS1_CSIO_BASE                        (0x40038100UL) /* MFS1 Base Address */
#define FM_MFS1_I2C_BASE                          (0x40038100UL) /* MFS1 Base Address */
#define FM4_MFS1_I2C_BASE                         (0x40038100UL) /* MFS1 Base Address */
#define FM_MFS1_I2S_BASE                          (0x40038100UL) /* MFS1 Base Address */
#define FM4_MFS1_I2S_BASE                         (0x40038100UL) /* MFS1 Base Address */
#define FM_MFS1_LIN_BASE                          (0x40038100UL) /* MFS1 Base Address */
#define FM4_MFS1_LIN_BASE                         (0x40038100UL) /* MFS1 Base Address */
#define FM_MFS1_UART_BASE                         (0x40038100UL) /* MFS1 Base Address */
#define FM4_MFS1_UART_BASE                        (0x40038100UL) /* MFS1 Base Address */
#define FM_MFS2_BASE                              (0x40038200UL) /* MFS2 Base Address */
#define FM4_MFS2_BASE                             (0x40038200UL) /* MFS2 Base Address */
#define FM_MFS2_CSIO_BASE                         (0x40038200UL) /* MFS2 Base Address */
#define FM4_MFS2_CSIO_BASE                        (0x40038200UL) /* MFS2 Base Address */
#define FM_MFS2_I2C_BASE                          (0x40038200UL) /* MFS2 Base Address */
#define FM4_MFS2_I2C_BASE                         (0x40038200UL) /* MFS2 Base Address */
#define FM_MFS2_LIN_BASE                          (0x40038200UL) /* MFS2 Base Address */
#define FM4_MFS2_LIN_BASE                         (0x40038200UL) /* MFS2 Base Address */
#define FM_MFS2_UART_BASE                         (0x40038200UL) /* MFS2 Base Address */
#define FM4_MFS2_UART_BASE                        (0x40038200UL) /* MFS2 Base Address */
#define FM_MFS3_BASE                              (0x40038300UL) /* MFS3 Base Address */
#define FM4_MFS3_BASE                             (0x40038300UL) /* MFS3 Base Address */
#define FM_MFS3_CSIO_BASE                         (0x40038300UL) /* MFS3 Base Address */
#define FM4_MFS3_CSIO_BASE                        (0x40038300UL) /* MFS3 Base Address */
#define FM_MFS3_I2C_BASE                          (0x40038300UL) /* MFS3 Base Address */
#define FM4_MFS3_I2C_BASE                         (0x40038300UL) /* MFS3 Base Address */
#define FM_MFS3_LIN_BASE                          (0x40038300UL) /* MFS3 Base Address */
#define FM4_MFS3_LIN_BASE                         (0x40038300UL) /* MFS3 Base Address */
#define FM_MFS3_UART_BASE                         (0x40038300UL) /* MFS3 Base Address */
#define FM4_MFS3_UART_BASE                        (0x40038300UL) /* MFS3 Base Address */
#define FM_MFS4_BASE                              (0x40038400UL) /* MFS4 Base Address */
#define FM4_MFS4_BASE                             (0x40038400UL) /* MFS4 Base Address */
#define FM_MFS4_CSIO_BASE                         (0x40038400UL) /* MFS4 Base Address */
#define FM4_MFS4_CSIO_BASE                        (0x40038400UL) /* MFS4 Base Address */
#define FM_MFS4_I2C_BASE                          (0x40038400UL) /* MFS4 Base Address */
#define FM4_MFS4_I2C_BASE                         (0x40038400UL) /* MFS4 Base Address */
#define FM_MFS4_LIN_BASE                          (0x40038400UL) /* MFS4 Base Address */
#define FM4_MFS4_LIN_BASE                         (0x40038400UL) /* MFS4 Base Address */
#define FM_MFS4_UART_BASE                         (0x40038400UL) /* MFS4 Base Address */
#define FM4_MFS4_UART_BASE                        (0x40038400UL) /* MFS4 Base Address */
#define FM_MFS5_BASE                              (0x40038500UL) /* MFS5 Base Address */
#define FM4_MFS5_BASE                             (0x40038500UL) /* MFS5 Base Address */
#define FM_MFS5_CSIO_BASE                         (0x40038500UL) /* MFS5 Base Address */
#define FM4_MFS5_CSIO_BASE                        (0x40038500UL) /* MFS5 Base Address */
#define FM_MFS5_I2C_BASE                          (0x40038500UL) /* MFS5 Base Address */
#define FM4_MFS5_I2C_BASE                         (0x40038500UL) /* MFS5 Base Address */
#define FM_MFS5_LIN_BASE                          (0x40038500UL) /* MFS5 Base Address */
#define FM4_MFS5_LIN_BASE                         (0x40038500UL) /* MFS5 Base Address */
#define FM_MFS5_UART_BASE                         (0x40038500UL) /* MFS5 Base Address */
#define FM4_MFS5_UART_BASE                        (0x40038500UL) /* MFS5 Base Address */
#define FM_MFS6_BASE                              (0x40038600UL) /* MFS6 Base Address */
#define FM4_MFS6_BASE                             (0x40038600UL) /* MFS6 Base Address */
#define FM_MFS6_CSIO_BASE                         (0x40038600UL) /* MFS6 Base Address */
#define FM4_MFS6_CSIO_BASE                        (0x40038600UL) /* MFS6 Base Address */
#define FM_MFS6_I2C_BASE                          (0x40038600UL) /* MFS6 Base Address */
#define FM4_MFS6_I2C_BASE                         (0x40038600UL) /* MFS6 Base Address */
#define FM_MFS6_LIN_BASE                          (0x40038600UL) /* MFS6 Base Address */
#define FM4_MFS6_LIN_BASE                         (0x40038600UL) /* MFS6 Base Address */
#define FM_MFS6_UART_BASE                         (0x40038600UL) /* MFS6 Base Address */
#define FM4_MFS6_UART_BASE                        (0x40038600UL) /* MFS6 Base Address */
#define FM_MFS7_BASE                              (0x40038700UL) /* MFS7 Base Address */
#define FM4_MFS7_BASE                             (0x40038700UL) /* MFS7 Base Address */
#define FM_MFS7_CSIO_BASE                         (0x40038700UL) /* MFS7 Base Address */
#define FM4_MFS7_CSIO_BASE                        (0x40038700UL) /* MFS7 Base Address */
#define FM_MFS7_I2C_BASE                          (0x40038700UL) /* MFS7 Base Address */
#define FM4_MFS7_I2C_BASE                         (0x40038700UL) /* MFS7 Base Address */
#define FM_MFS7_LIN_BASE                          (0x40038700UL) /* MFS7 Base Address */
#define FM4_MFS7_LIN_BASE                         (0x40038700UL) /* MFS7 Base Address */
#define FM_MFS7_UART_BASE                         (0x40038700UL) /* MFS7 Base Address */
#define FM4_MFS7_UART_BASE                        (0x40038700UL) /* MFS7 Base Address */
#define FM_MFS8_BASE                              (0x40038800UL) /* MFS8 Base Address */
#define FM4_MFS8_BASE                             (0x40038800UL) /* MFS8 Base Address */
#define FM_MFS8_CSIO_BASE                         (0x40038800UL) /* MFS8 Base Address */
#define FM4_MFS8_CSIO_BASE                        (0x40038800UL) /* MFS8 Base Address */
#define FM_MFS8_I2C_BASE                          (0x40038800UL) /* MFS8 Base Address */
#define FM4_MFS8_I2C_BASE                         (0x40038800UL) /* MFS8 Base Address */
#define FM_MFS8_LIN_BASE                          (0x40038800UL) /* MFS8 Base Address */
#define FM4_MFS8_LIN_BASE                         (0x40038800UL) /* MFS8 Base Address */
#define FM_MFS8_UART_BASE                         (0x40038800UL) /* MFS8 Base Address */
#define FM4_MFS8_UART_BASE                        (0x40038800UL) /* MFS8 Base Address */
#define FM_MFS9_BASE                              (0x40038900UL) /* MFS9 Base Address */
#define FM4_MFS9_BASE                             (0x40038900UL) /* MFS9 Base Address */
#define FM_MFS9_CSIO_BASE                         (0x40038900UL) /* MFS9 Base Address */
#define FM4_MFS9_CSIO_BASE                        (0x40038900UL) /* MFS9 Base Address */
#define FM_MFS9_I2C_BASE                          (0x40038900UL) /* MFS9 Base Address */
#define FM4_MFS9_I2C_BASE                         (0x40038900UL) /* MFS9 Base Address */
#define FM_MFS9_LIN_BASE                          (0x40038900UL) /* MFS9 Base Address */
#define FM4_MFS9_LIN_BASE                         (0x40038900UL) /* MFS9 Base Address */
#define FM_MFS9_UART_BASE                         (0x40038900UL) /* MFS9 Base Address */
#define FM4_MFS9_UART_BASE                        (0x40038900UL) /* MFS9 Base Address */
#define FM_MFSI2SA_BASE                           (0x4003CA00UL) /* MFSI2SA Base Address */
#define FM4_MFSI2SA_BASE                          (0x4003CA00UL) /* MFSI2SA Base Address */
#define FM_MFT_PPG_BASE                           (0x40024000UL) /* MFT_PPG Base Address */
#define FM4_MFT_PPG_BASE                          (0x40024000UL) /* MFT_PPG Base Address */
#define FM_MFT0_BASE                              (0x40020000UL) /* MFT0 Base Address */
#define FM4_MFT0_BASE                             (0x40020000UL) /* MFT0 Base Address */
#define FM_MFT0_ADCMP_BASE                        (0x40020000UL) /* MFT0 Base Address */
#define FM4_MFT0_ADCMP_BASE                       (0x40020000UL) /* MFT0 Base Address */
#define FM_MFT0_FRT_BASE                          (0x40020000UL) /* MFT0 Base Address */
#define FM4_MFT0_FRT_BASE                         (0x40020000UL) /* MFT0 Base Address */
#define FM_MFT0_ICU_BASE                          (0x40020000UL) /* MFT0 Base Address */
#define FM4_MFT0_ICU_BASE                         (0x40020000UL) /* MFT0 Base Address */
#define FM_MFT0_OCU_BASE                          (0x40020000UL) /* MFT0 Base Address */
#define FM4_MFT0_OCU_BASE                         (0x40020000UL) /* MFT0 Base Address */
#define FM_MFT0_WFG_BASE                          (0x40020000UL) /* MFT0 Base Address */
#define FM4_MFT0_WFG_BASE                         (0x40020000UL) /* MFT0 Base Address */
#define FM_MFT1_BASE                              (0x40021000UL) /* MFT1 Base Address */
#define FM4_MFT1_BASE                             (0x40021000UL) /* MFT1 Base Address */
#define FM_MFT1_ADCMP_BASE                        (0x40021000UL) /* MFT1 Base Address */
#define FM4_MFT1_ADCMP_BASE                       (0x40021000UL) /* MFT1 Base Address */
#define FM_MFT1_FRT_BASE                          (0x40021000UL) /* MFT1 Base Address */
#define FM4_MFT1_FRT_BASE                         (0x40021000UL) /* MFT1 Base Address */
#define FM_MFT1_ICU_BASE                          (0x40021000UL) /* MFT1 Base Address */
#define FM4_MFT1_ICU_BASE                         (0x40021000UL) /* MFT1 Base Address */
#define FM_MFT1_OCU_BASE                          (0x40021000UL) /* MFT1 Base Address */
#define FM4_MFT1_OCU_BASE                         (0x40021000UL) /* MFT1 Base Address */
#define FM_MFT1_WFG_BASE                          (0x40021000UL) /* MFT1 Base Address */
#define FM4_MFT1_WFG_BASE                         (0x40021000UL) /* MFT1 Base Address */
#define FM_QPRC0_BASE                             (0x40026000UL) /* QPRC0 Base Address */
#define FM4_QPRC0_BASE                            (0x40026000UL) /* QPRC0 Base Address */
#define FM_QPRC0_NF_BASE                          (0x40026100UL) /* QPRC0_NF Base Address */
#define FM4_QPRC0_NF_BASE                         (0x40026100UL) /* QPRC0_NF Base Address */
#define FM_QPRC1_BASE                             (0x40026040UL) /* QPRC1 Base Address */
#define FM4_QPRC1_BASE                            (0x40026040UL) /* QPRC1 Base Address */
#define FM_QPRC1_NF_BASE                          (0x40026110UL) /* QPRC1_NF Base Address */
#define FM4_QPRC1_NF_BASE                         (0x40026110UL) /* QPRC1_NF Base Address */
#define FM_QPRC2_BASE                             (0x40026080UL) /* QPRC2 Base Address */
#define FM4_QPRC2_BASE                            (0x40026080UL) /* QPRC2 Base Address */
#define FM_QPRC2_NF_BASE                          (0x40026120UL) /* QPRC2_NF Base Address */
#define FM4_QPRC2_NF_BASE                         (0x40026120UL) /* QPRC2_NF Base Address */
#define FM_QPRC3_BASE                             (0x400260C0UL) /* QPRC3 Base Address */
#define FM4_QPRC3_BASE                            (0x400260C0UL) /* QPRC3 Base Address */
#define FM_QPRC3_NF_BASE                          (0x40026130UL) /* QPRC3_NF Base Address */
#define FM4_QPRC3_NF_BASE                         (0x40026130UL) /* QPRC3_NF Base Address */
#define FM_RTC_BASE                               (0x4003B000UL) /* RTC Base Address */
#define FM4_RTC_BASE                              (0x4003B000UL) /* RTC Base Address */
#define FM_SBSSR_BASE                             (0x40025F00UL) /* SBSSR Base Address */
#define FM4_SBSSR_BASE                            (0x40025F00UL) /* SBSSR Base Address */
#define FM_SDIF_BASE                              (0x4006E000UL) /* SDIF Base Address */
#define FM4_SDIF_BASE                             (0x4006E000UL) /* SDIF Base Address */
#define FM_SMCIF0_BASE                            (0x4003C900UL) /* SMCIF0 Base Address */
#define FM4_SMCIF0_BASE                           (0x4003C900UL) /* SMCIF0 Base Address */
#define FM_SMCIF1_BASE                            (0x4003C980UL) /* SMCIF1 Base Address */
#define FM4_SMCIF1_BASE                           (0x4003C980UL) /* SMCIF1 Base Address */
#define FM_SWWDT_BASE                             (0x40012000UL) /* SWWDT Base Address */
#define FM4_SWWDT_BASE                            (0x40012000UL) /* SWWDT Base Address */
#define FM_UNIQUE_ID_BASE                         (0x40000200UL) /* UNIQUE_ID Base Address */
#define FM4_UNIQUE_ID_BASE                        (0x40000200UL) /* UNIQUE_ID Base Address */
#define FM_USB0_BASE                              (0x40040000UL) /* USB0 Base Address */
#define FM4_USB0_BASE                             (0x40040000UL) /* USB0 Base Address */
#define FM_USB1_BASE                              (0x40052100UL) /* USB1 Base Address */
#define FM4_USB1_BASE                             (0x40052100UL) /* USB1 Base Address */
#define FM_USBETHERCLK_BASE                       (0x40036000UL) /* USBETHERCLK Base Address */
#define FM4_USBETHERCLK_BASE                      (0x40036000UL) /* USBETHERCLK Base Address */
#define FM_WC_BASE                                (0x4003A000UL) /* WC Base Address */
#define FM4_WC_BASE                               (0x4003A000UL) /* WC Base Address */
/*******************************************************************************
* Peripheral declaration
*******************************************************************************/
#define FM4_ADC0                                  ((FM_ADC_TypeDef *)FM4_ADC0_BASE)
#define FM_ADC0                                   ((FM_ADC_TypeDef *)FM4_ADC0_BASE)
#define FM4_ADC1                                  ((FM_ADC_TypeDef *)FM4_ADC1_BASE)
#define FM_ADC1                                   ((FM_ADC_TypeDef *)FM4_ADC1_BASE)
#define FM4_ADC2                                  ((FM_ADC_TypeDef *)FM4_ADC2_BASE)
#define FM_ADC2                                   ((FM_ADC_TypeDef *)FM4_ADC2_BASE)
#define FM4_BT0                                   ((FM_BT_TypeDef *)FM4_BT0_BASE)
#define FM_BT0                                    ((FM_BT_TypeDef *)FM4_BT0_BASE)
#define FM4_BT0_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT0_BASE)
#define FM_BT0_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT0_BASE)
#define FM4_BT0_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT0_BASE)
#define FM_BT0_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT0_BASE)
#define FM4_BT0_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT0_BASE)
#define FM_BT0_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT0_BASE)
#define FM4_BT0_RT                                ((FM_BT_RT_TypeDef *)FM4_BT0_BASE)
#define FM_BT0_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT0_BASE)
#define FM4_BT1                                   ((FM_BT_TypeDef *)FM4_BT1_BASE)
#define FM_BT1                                    ((FM_BT_TypeDef *)FM4_BT1_BASE)
#define FM4_BT1_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT1_BASE)
#define FM_BT1_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT1_BASE)
#define FM4_BT1_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT1_BASE)
#define FM_BT1_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT1_BASE)
#define FM4_BT1_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT1_BASE)
#define FM_BT1_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT1_BASE)
#define FM4_BT1_RT                                ((FM_BT_RT_TypeDef *)FM4_BT1_BASE)
#define FM_BT1_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT1_BASE)
#define FM4_BT10                                  ((FM_BT_TypeDef *)FM4_BT10_BASE)
#define FM_BT10                                   ((FM_BT_TypeDef *)FM4_BT10_BASE)
#define FM4_BT10_PPG                              ((FM_BT_PPG_TypeDef *)FM4_BT10_BASE)
#define FM_BT10_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT10_BASE)
#define FM4_BT10_PWC                              ((FM_BT_PWC_TypeDef *)FM4_BT10_BASE)
#define FM_BT10_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT10_BASE)
#define FM4_BT10_PWM                              ((FM_BT_PWM_TypeDef *)FM4_BT10_BASE)
#define FM_BT10_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT10_BASE)
#define FM4_BT10_RT                               ((FM_BT_RT_TypeDef *)FM4_BT10_BASE)
#define FM_BT10_RT                                ((FM_BT_RT_TypeDef *)FM4_BT10_BASE)
#define FM4_BT11                                  ((FM_BT_TypeDef *)FM4_BT11_BASE)
#define FM_BT11                                   ((FM_BT_TypeDef *)FM4_BT11_BASE)
#define FM4_BT11_PPG                              ((FM_BT_PPG_TypeDef *)FM4_BT11_BASE)
#define FM_BT11_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT11_BASE)
#define FM4_BT11_PWC                              ((FM_BT_PWC_TypeDef *)FM4_BT11_BASE)
#define FM_BT11_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT11_BASE)
#define FM4_BT11_PWM                              ((FM_BT_PWM_TypeDef *)FM4_BT11_BASE)
#define FM_BT11_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT11_BASE)
#define FM4_BT11_RT                               ((FM_BT_RT_TypeDef *)FM4_BT11_BASE)
#define FM_BT11_RT                                ((FM_BT_RT_TypeDef *)FM4_BT11_BASE)
#define FM4_BT12                                  ((FM_BT_TypeDef *)FM4_BT12_BASE)
#define FM_BT12                                   ((FM_BT_TypeDef *)FM4_BT12_BASE)
#define FM4_BT12_PPG                              ((FM_BT_PPG_TypeDef *)FM4_BT12_BASE)
#define FM_BT12_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT12_BASE)
#define FM4_BT12_PWC                              ((FM_BT_PWC_TypeDef *)FM4_BT12_BASE)
#define FM_BT12_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT12_BASE)
#define FM4_BT12_PWM                              ((FM_BT_PWM_TypeDef *)FM4_BT12_BASE)
#define FM_BT12_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT12_BASE)
#define FM4_BT12_RT                               ((FM_BT_RT_TypeDef *)FM4_BT12_BASE)
#define FM_BT12_RT                                ((FM_BT_RT_TypeDef *)FM4_BT12_BASE)
#define FM4_BT13                                  ((FM_BT_TypeDef *)FM4_BT13_BASE)
#define FM_BT13                                   ((FM_BT_TypeDef *)FM4_BT13_BASE)
#define FM4_BT13_PPG                              ((FM_BT_PPG_TypeDef *)FM4_BT13_BASE)
#define FM_BT13_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT13_BASE)
#define FM4_BT13_PWC                              ((FM_BT_PWC_TypeDef *)FM4_BT13_BASE)
#define FM_BT13_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT13_BASE)
#define FM4_BT13_PWM                              ((FM_BT_PWM_TypeDef *)FM4_BT13_BASE)
#define FM_BT13_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT13_BASE)
#define FM4_BT13_RT                               ((FM_BT_RT_TypeDef *)FM4_BT13_BASE)
#define FM_BT13_RT                                ((FM_BT_RT_TypeDef *)FM4_BT13_BASE)
#define FM4_BT14                                  ((FM_BT_TypeDef *)FM4_BT14_BASE)
#define FM_BT14                                   ((FM_BT_TypeDef *)FM4_BT14_BASE)
#define FM4_BT14_PPG                              ((FM_BT_PPG_TypeDef *)FM4_BT14_BASE)
#define FM_BT14_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT14_BASE)
#define FM4_BT14_PWC                              ((FM_BT_PWC_TypeDef *)FM4_BT14_BASE)
#define FM_BT14_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT14_BASE)
#define FM4_BT14_PWM                              ((FM_BT_PWM_TypeDef *)FM4_BT14_BASE)
#define FM_BT14_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT14_BASE)
#define FM4_BT14_RT                               ((FM_BT_RT_TypeDef *)FM4_BT14_BASE)
#define FM_BT14_RT                                ((FM_BT_RT_TypeDef *)FM4_BT14_BASE)
#define FM4_BT15                                  ((FM_BT_TypeDef *)FM4_BT15_BASE)
#define FM_BT15                                   ((FM_BT_TypeDef *)FM4_BT15_BASE)
#define FM4_BT15_PPG                              ((FM_BT_PPG_TypeDef *)FM4_BT15_BASE)
#define FM_BT15_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT15_BASE)
#define FM4_BT15_PWC                              ((FM_BT_PWC_TypeDef *)FM4_BT15_BASE)
#define FM_BT15_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT15_BASE)
#define FM4_BT15_PWM                              ((FM_BT_PWM_TypeDef *)FM4_BT15_BASE)
#define FM_BT15_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT15_BASE)
#define FM4_BT15_RT                               ((FM_BT_RT_TypeDef *)FM4_BT15_BASE)
#define FM_BT15_RT                                ((FM_BT_RT_TypeDef *)FM4_BT15_BASE)
#define FM4_BT2                                   ((FM_BT_TypeDef *)FM4_BT2_BASE)
#define FM_BT2                                    ((FM_BT_TypeDef *)FM4_BT2_BASE)
#define FM4_BT2_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT2_BASE)
#define FM_BT2_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT2_BASE)
#define FM4_BT2_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT2_BASE)
#define FM_BT2_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT2_BASE)
#define FM4_BT2_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT2_BASE)
#define FM_BT2_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT2_BASE)
#define FM4_BT2_RT                                ((FM_BT_RT_TypeDef *)FM4_BT2_BASE)
#define FM_BT2_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT2_BASE)
#define FM4_BT3                                   ((FM_BT_TypeDef *)FM4_BT3_BASE)
#define FM_BT3                                    ((FM_BT_TypeDef *)FM4_BT3_BASE)
#define FM4_BT3_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT3_BASE)
#define FM_BT3_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT3_BASE)
#define FM4_BT3_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT3_BASE)
#define FM_BT3_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT3_BASE)
#define FM4_BT3_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT3_BASE)
#define FM_BT3_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT3_BASE)
#define FM4_BT3_RT                                ((FM_BT_RT_TypeDef *)FM4_BT3_BASE)
#define FM_BT3_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT3_BASE)
#define FM4_BT4                                   ((FM_BT_TypeDef *)FM4_BT4_BASE)
#define FM_BT4                                    ((FM_BT_TypeDef *)FM4_BT4_BASE)
#define FM4_BT4_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT4_BASE)
#define FM_BT4_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT4_BASE)
#define FM4_BT4_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT4_BASE)
#define FM_BT4_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT4_BASE)
